// --------------------------------------------------------------------------
// ✅ 테스트 시나리오
// --------------------------------------------------------------------------
// - [ ] name 속성이 전달되지 않은 경우 로그인 버튼이 표시됩니다.
//   - 문서에 버튼이 표시되는 지 확인합니다.
//   - 버튼 내용이 "로그인"인지 확인합니다.
// - [ ] name 속성(prop)이 전달되면 "안녕! {name} 😊" 제목이 표시됩니다.
//   - 문서에 제목이 표시되는 지 확인합니다.
//   - 제목 내용이 "안녕! {name} 😊"인지 확인합니다.
// --------------------------------------------------------------------------

import { string } from 'prop-types';

Greet.propTypes = {
  name: string,
};

function Greet({ name }) {
  if (name) {
    return <h1>안녕! {name} 😊</h1>;
  }

  return <button type="button">로그인</button>;
}

export default Greet;
