// --------------------------------------------------------------------------
// ✅ 할 일 목록(Todo List) 실습
// --------------------------------------------------------------------------
// - [ ] 할 일 목록 UI를 참고, 분석합니다. (https://bit.ly/3X2oXyo)
// - [ ] TodoList 앱 컴포넌트 트리를 구성합니다.
// - [ ] TodoList 앱에서 관리되어야 할 상태를 선언합니다.
// - [ ] Pocketbase 솔루션을 사용해 백엔드 환경을 구성합니다.
// - [ ] TodoList 리액트 앱과 백엔드 환경이 동기화되도록 구성합니다.
// --------------------------------------------------------------------------

import S from './TodoList.module.css';

function TodoList() {
  return <div className={S.component}></div>;
}

export default TodoList;
