// --------------------------------------------------------------------------
// Virtual DOM
// React에서 사용 되는 가상 DOM(문서 객체 모델) 개념을 정리합니다.
// --------------------------------------------------------------------------

// 🔶 lib 폴더에 아래 유틸리티 함수를 각 파일에 작성하고, 내보내기 구문을 설정합니다.
//
// lib/
// ├── virtual/
// │   ├── createElement.js (export default)
// │   └── index.js
// ├── virtual-dom/
// │   ├── VirtualDomRoot.js (export default)
// │   ├── createRoot.js (import / export default)
// │   └── index.js
// └── index.js
